Repository: plamer777/Coursework_6
Catalog: skymarket/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Enter a title here
ru: Введите название

source: Enter your price here
ru: Введите цену

source: Upload a photo for this ad
ru: Загрузите фото для вашего объявления

source: Write your description here
ru: Укажите описание

source: This field stores the author id
ru: Это поле хранит id автора

source: The date this ad was created
ru: Дата, когда объявление было создано

source: Advertisement
ru: Объявление

source: Advertisements
ru: Объявления

source: Enter a comment here
ru: Введите ваш комментарий

source: This field stores the ad id
ru: Это поле хранит id объявления

source: The date this comment was created
ru: Дата создания комментария

source: Comment
ru: Отзыв

source: Comments
ru: Отзывы

source: Returns a list of advertisements sorted by creation date
ru: Возвращает список объявлений, отсортированных по дате добавления

source: A list of advertisements
ru: Список объявлений

source: Returns a detail advertisement
ru: Возвращает подробную информацию об объявлении

source: A detail advertisement
ru: Подробная информация об объявлении

source: Adds a new advertisement to the database
ru: Добавление нового объявления в базу

source: Add advertisement
ru: Добавить объявление

source: Updates all fields of the certain advertisement
ru: Обновить все поля объявления

source: Update advertisement
ru: Обновление всех полей объявления

source: Updates chosen fields of the certain advertisement
ru: Обновление выбранных полей объявления

source: Partially update advertisement
ru: Частичное обновление объявления

source: Deletes the advertisement from the database
ru: Удаление объявления из базы данных

source: Delete advertisement
ru: Удалить объявление

source: Returns a list of user's advertisements
ru: Получение списка всех объявлений авторизованного пользователя

source: A list of user's advertisements
ru: Список всех пользовательских объявлений

source: Returns a list of all comments
ru: Получение списка всех комментариев по заданному объявлению

source: A list of comments
ru: Список комментариев

source: Returns a detail comment
ru: Получить детальную информацию об отзыве

source: A detail comment
ru: Детальный отзыв

source: Adds a new comment to the database
ru: Добавление нового отзыва

source: Add comment
ru: Добавить отзыв

source: Updates all fields of the certain comment
ru: Обновить все поля конкретного отзыва

source: Update comment
ru: Обновить отзыв

source: Updates chosen fields of the certain comment
ru: Обновить выбранные поля отзыва

source: Partially update comment
ru: Частичное обновление отзыва

source: Deletes the comment from the database
ru: Удаление комментария из базы

source: Delete comment
ru: Удалить комментарий

source: Email is required
ru: Необходимо указать email

source: Admin
ru: Администратор

source: User
ru: Пользователь

source: This field is used to register and log-in
ru: Это поле используется для регистрации и входа в аккаунт

source: First name of user
ru: Имя пользователя

source: Last name of user
ru: Фамилия пользователя

source: Your phone number
ru: Ваш номер телефона

source: Role of user
ru: Роль пользователя

source: Path to an avatar to upload
ru: Путь к файлу для загрузки аватарки пользователя

source: Users
ru: Пользователи

source: Returns a list of all users
ru: Данный маршрут возвращает список всех пользователей

source: A list of users
ru: Список пользователей

source: Returns a detail user
ru: Получение подробной информации о пользователе

source: A detail user
ru: Детальное инфо пользователя

source: Adds a new user to the database
ru: Добавление нового пользователя в базу данных

source: Add user
ru: Добавить пользователя

source: Updates all fields of the certain user
ru: Обновить все поля в модели пользователя

source: Update user
ru: Обновить данные пользователя

source: Updates chosen fields of the certain user
ru: Обновить выбранные поля модели пользователя

source: Partially update user
ru: Частичное обновление пользователя

source: Deletes the user from the database
ru: Удаление пользователя из базы данных

source: Delete user
ru: Удалить пользователя

source: Allows current user to get a detail info of his profile, change or delete it
ru: Данная ручка позволяет авторизованному пользователю получить информацию о себе, обновить ее или удалить

source: Current user
ru: Текущий авторизованный пользователь

source: Activates account of the user
ru: Данный маршрут служит для активации аккаунта пользователя

source: Account activation
ru: Активация аккаунта

source: Sends one more activation request to the user
ru: Получить повторный запрос на активацию аккаунта

source: Resend activation request
ru: Повторно отправить запрос на активацию

source: Sends a request to reset the password
ru: Отправить запрос на сброс пароля

source: Reset password request
ru: Сброс пароля

source: Confirmation of reset password request
ru: Получение подтверждения от пользователя о сбросе пароля

source: Reset password confirmation
ru: Подтверждение сброса пароля

source: Allows user to set a new password
ru: Маршрут позволяют пользователю сменить пароль

source: Change password
ru: Смена пароля

source: Allows user to set a new username
ru: Маршрут позволяют пользователю сменить имя пользователя

source: Change username
ru: Сменить имя пользователя

source: Allows user to get a request to reset his username
ru: Маршрут служит для отправки запроса на смену имени пользователя

source: Reset username request
ru: Запрос на смену имени пользователя

source: Confirmation of reset username request
ru: Маршрут служит для получения подтверждения от пользователя о смене имени пользователя

source: Reset username confirmation
ru: Подтверждение на смену имени пользователя
